app/controllers/puppies_controller.rb

SELECT "puppies".* FROM "puppies"
---
  def index
  	@puppies = Puppy.all

INSERT INTO "puppies" ("name", "bio", "breed", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Milo"], ["bio", ""], ["breed", ""], ["image_url", ""], ["created_at", "2015-07-16 23:50:16.491032"], ["updated_at", "2015-07-16 23:50:16.491032"]]
---
  def create
  	# puts puppy_params
  	@puppy = Puppy.create(puppy_params)

SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = $1 LIMIT 1  [["id", 121]]
---
  def edit
  	@puppy = Puppy.find(params[:id])

SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = $1 LIMIT 1  [["id", 35]]
---
  def show
  	@puppy = Puppy.find_by(id: params[:id])

SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = $1 LIMIT 1  [["id", 121]]
UPDATE "puppies" SET "name" = $1, "updated_at" = $2 WHERE "puppies"."id" = $3  [["name", "Otis"], ["updated_at", "2015-07-17 00:24:17.006032"], ["id", 121]]
---
  def update
  	@puppy = Puppy.find_by(id: params[:id])
  	@puppy.update(puppy_params)

SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = $1 LIMIT 1  [["id", 129]]
DELETE FROM "puppies" WHERE "puppies"."id" = $1  [["id", 129]]
---
  def destroy
  	@puppy = Puppy.find_by(id: params[:id])
  	@puppy.destroy